// Створити змінну з іменем age і присвоїти їй значення свого віку. Вивести значення цієї змінної в консоль.

let my_age = 15; 
console.log(my_age); 

// Створити змінну з іменем name і присвоїти їй значення свого імені. Вивести значення цієї змінної в консоль.

let my_name = "Maxim"
console.log(my_name); 

// Створити змінну з іменем isStudent і присвоїти їй значення true або false, залежно від того, чи є студентом. 
// Вивести значення цієї змінної в консоль.

let isStudent = true;

// Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою. Вивести цей рядок в консоль.

let mySrting = "Один мудрець сказав: 'Не Богами дано відмінність'. Але ця фраза має продовження - 'Ми народжуємося рівними, але наше майбутнє залежить від нас. Ці відмінності залежать від якості освіти або її відсутності.'"; 
console.log(mySrting);

// Створити змінну з іменем myNumber і присвоїти їй довільне числове значення.
//  Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.

let myNamber = 888; 
myNamber = myNamber + 10; 
console.log(myNamber);


// Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.

let myNull = null; 
console.log(myNull);


// Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt().
//  Після введення імені вивести повідомлення привітання з використанням введеного імені. 

let user_name = prompt(); 
console.log("Привіт! " + user_name);



// Створити скрипт який виводить спливаюче підтвердження за допомогою confirm().
//  Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". 
//  Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

let userConfirmation = confirm("Ви впевнені, що хочете підтвердити дію?");
if (userConfirmation){ 
    alert("Дякуємо за підтвердження");
}else{ 
        alert("Дію відмінено")
}


// Створити скрипт який виводить спливаюче попередження за допомогою alert().
//  Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm(). 
//  Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". 
//  Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

let userConfirmationOfDanger = confirm("Небезпечна дія!!! Ви впевнені, що хочете підтвердити дію?");
if (userConfirmationOfDanger){ 
    alert("Дякуємо за підтвердження!");
}else{ 
        alert("Дію відмінено!")
}
